

#ifndef UNKNOWN_CLOSEQUESTIONS_H
#define UNKNOWN_CLOSEQUESTIONS_H

#include <iostream>

using namespace std;

class closeQuestions {

public:

    void menuCloseQuestions (int number) {

        switch (number) {

            case 1: {
                cout << "Что помогает тебе восстановиться, когда ты устал или пережил сильный стресс?\n";
                break;
            }

            case 2: {
                cout << "Что способно привести тебя в восторг, обрадовать?\n";
                break;
            }

            case 3: {
                cout << "Тебе лучше придумывать что-то или делать?\n";
                break;
            }

            case 4: {
                cout << "Что тебя злит и раздражает?\n";
                break;
            }

            case 5: {
                cout << "Каким образом ты проявляешь свой интерес к другому человеку?\n";
                break;
            }

            case 6: {
                cout << "Какой учитель в школе у тебя вызывал уважение и почему?\n";
                break;
            }

            case 7: {
                cout << "Что тебе нравится во мне? Есть ли черты, которыми ты тоже хотел обладать?\n";
                break;
            }

            case 8: {
                cout << "Что ты категорически отвергаешь в людях?\n";
                break;
            }

            case 9: {
                cout << "С чем ты никогда не сможешь смириться?\n";
                break;
            }

            case 10: {
                cout << "Ты умеешь прощать, только искренне, не напоминая периодически обидчику о его вине?\n";
                break;
            }

            case 11: {
                cout << "Чему бы ты хотел научиться?\n";
                break;
            }

            case 12: {
                cout << "Есть ли что-то, чем ты гордишься и хотел бы мне об этом рассказать?\n";
                break;
            }

            case 13: {
                cout << "Какой твой самый приятный и тёплый момент из детства? Расскажи о нём подробнее.\n";
                break;
            }

            case 14: {
                cout << "Что именно ты привносишь в понятие любовь?\n";
                break;
            }

            case 15: {
                cout << "Случалось ли тебе попадать в нелепые и интересные ситуации? Поделись какой-то смешной историей из своей жизни.\n";
                break;
            }

            case 16: {
                cout << "Кого ты можешь поблагодарить за то, что ты такой сейчас, какой есть?\n";
                break;
            }

            case 17: {
                cout << "А изменил бы что-то в прошлом, если бы у тебя появился шанс исправить лишь одну ошибку? Подумай хорошо, потому что это изменит настоящее.\n";
                break;
            }

            case 18: {
                cout << "Как ты думаешь, тебя можно назвать счастливым человеком?\n";
                break;
            }

            case 19: {
                cout << "Расскажи о своих самых близких людях. За что ты их любишь, как встретил их?\n";
                break;
            }

            case 20: {
                cout << "Есть ли в твоём опыте случай, когда ты помогал совершенно незнакомому человеку? Если да, то расскажи об этом подробнее.\n";
                break;
            }

            case 21: {
                cout << "Как ты думаешь, что окружающим людям в тебе нравится больше всего?\n";
                break;
            }

            case 22: {
                cout << "Ты помнишь, на что потратил свои первые заработанные деньги? Что ты чувствовал в тот момент?\n";
                break;
            }

            case 23: {
                cout << "Как ты обычно реагируешь, когда тебя просят о помощи?\n";
                break;
            }

            case 24: {
                cout << "Что должен сделать или сказать человек, чтобы ты сразу понял, что больше не хочешь с ним встречаться?\n";
                break;
            }

            case 25: {
                cout << "Ты больше любишь дарить подарки, или получать их? Какие чувства у тебя возникают в такой момент?\n";
                break;
            }

            case 26: {
                cout << "Есть ли у тебя тайна, которой ты совсем ни с кем ещё не делился? Если да, то из каких именно побуждений ты её хранишь?\n";
                break;
            }




        }

    }

};


#endif //UNKNOWN_CLOSEQUESTIONS_H
